export const questionArrInit = [
  {
    type: 'radio',
    question: '1.您最喜欢的电影类型是什么？',
    A: '爱情电影',
    B: '动作电影',
    C: '悬疑电影',
    D: '喜剧电影'
  },
  {
    type: 'radio',
    question: '2.您最喜欢的电影是什么？',
    A: '《泰坦尼克号》',
    B: '《肖申克的救赎》',
    C: '《阿甘正传》',
    D: '《楚门的世界》'
  },
  {
    type: 'radio',
    question: '3.您通常如何欣赏电影？',
    A: '独自观看',
    B: '和朋友/家人一起观看',
    C: '在线上社区或论坛讨论',
    D: '其他'
  }, {
    type: 'radio',
    question: '4.您是否经常观看电视剧或综艺节目？',
    A: '经常观看',
    B: '偶尔观看',
    C: '从不观看',
    D: '不确定'
  }, {
    type: 'radio',
    question: '5.您对于电影/电视剧的续集或衍生作品是否感兴趣?',
    A: '非常感兴趣',
    B: '有点感兴趣',
    C: '不感兴趣',
    D: '不确定'
  }, {
    type: 'radio',
    question: '6.您是否经常参与电影/电视剧相关的线上社区或论坛?',
    A: '经常参与',
    B: '偶尔参与',
    C: '从不参与',
    D: '不确定'
  }, {
    type: 'radio',
    question: '7.您认为电影/电视剧的教育意义有多大?',
    A: '非常大',
    B: '有点大',
    C: '不大',
    D: '没有'
  }, {
    type: 'radio',
    question: '8.您是否认为电影/电视剧的质量与制作团队的专业性有关?',
    A: '非常有关',
    B: '有点有关',
    C: '无关',
    D: '很有关'
  }, {
    type: 'radio',
    question: '9.您是否认为电影/电视剧的制作成本对于作品的质量有很大的影响?',
    A: '非常有关',
    B: '有点有关',
    C: '无关',
    D: '很有关'
  }, {
    type: 'radio',
    question: '10.您是否经常购买电影票之类的票？',
    A: '经常购买',
    B: '偶尔购买',
    C: '从不购买',
    D: '不确定'
  },
]